//-----------------------------------------------------функция выполнится после полной загрузки документа----------------------------------------------
$(function () {
  //-----------------------------------------------------клик по кнопке с цифрой-----------------------------------------------------------------------
  $(".num-button").click(function () {
    // debugger
    if ($("#display").val() == "0") {
      $("#display").val() = "";
    }
    $("#display").val($("#display").val() + $(this).text());
  });
  //-----------------------------------------------------клик по функциональной кнопке-----------------------------------------------------------------
  $(".function-button").click(function () {
    $("#display").val($("#display").val() + $(this).text());
  });
  //-----------------------------------------------------клик по кнопке "равно"------------------------------------------------------------------------
  $(".equals-button").click(function () {
    console.log($("#display").val());
  });
  //----------------------------------------------------клик по копке очистки экрана--------------------------------------------------------------------
  $(".clear-button").click(function () {
    $("#display").val('0');
  });
});